# Написать программу на языке Prolog для вычисления суммы элементов списка. На вход подаётся целочисленный массив. На выходе - сумма элементов массива.

arr= [1,2,4,6,7] #20
print(sum(arr))

